app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "witam.png"], ["image_content_type", "image/png"], ["image_file_size", 15070], ["image_updated_at", 2017-03-01 21:23:55 UTC], ["updated_at", 2017-03-01 21:23:55 UTC], ["id", 2]]
---
  def update
    @article = Article.find(params[:id])
    @article.update(article_params)